class BookMessage:
    NUMBER_LEN = 5
    MENU = 'Что будем делать? (Посмотреть - 1, Добавить - 2, Удалить - 3,  Выход - Any Key): '
    TITLE = '====Список контактов===='
    ENTER_NAME = 'Введите имя контакта: '
    ENTER_NUMBER = 'Ведите номер контакта: '
    ERR_NUMBER_LEN = f'Длинна номера должна быть {NUMBER_LEN}'
    EMPTY_NAME = 'Имя не может быть пустым'
    OVERWRITE_NUMBER = 'Контакт с таким именем уже есть. Хотите создать новый или изменить существующий (Создать - 1, Редактировать - 2): '
    EXIT = '\nВСЕГО ХОРОШЕГО!!!'
    DELETE_CONTACT = 'Контакт удален!'
    SUCCESS_ADD = 'Контакт успешно добавлен!'
    SUCCESS_CREATED = 'Файл создан'
    # ПРОДОЛЖИ

